; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_7_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 - counter
	)
  (:init
		(= (value c0) 52)
	(= (value c1) 67)
	(= (value c2) 99)
	(= (value c3) 79)
	(= (value c4) 41)
	(= (value c5) 22)
	(= (value c6) 95)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
		)
	)
)

; plan
1. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 3 of 6
2. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 3 of 6
3. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 3 of 6
4. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 3 of 6
5. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 3 of 6
6. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 3 of 6
7. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 3 of 6
8. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 3 of 6
9. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 3 of 6
10. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 3 of 6
11. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 3 of 6
12. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 3 of 6
13. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 3 of 6
14. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 3 of 6
15. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 3 of 6
16. (increase_rate c4)
   changed: (rate_value c4) from 5 to 6
   goals met: 3 of 6
17. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 3 of 6
18. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 3 of 6
19. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 3 of 6
20. (decrement c2)
   changed: (value c2) from 99 to 96
   goals met: 3 of 6
21. (increment c5)
   changed: (value c5) from 22 to 27
   goals met: 3 of 6
22. (increment c5)
   changed: (value c5) from 27 to 32
   goals met: 3 of 6
23. (increment c5)
   changed: (value c5) from 32 to 37
   goals met: 3 of 6
24. (increment c5)
   changed: (value c5) from 37 to 42
   goals met: 4 of 6
25. (increase_rate c4)
   changed: (rate_value c4) from 6 to 7
   goals met: 4 of 6
26. (increase_rate c4)
   changed: (rate_value c4) from 7 to 8
   goals met: 4 of 6
27. (increase_rate c4)
   changed: (rate_value c4) from 8 to 9
   goals met: 4 of 6
28. (increment c4)
   changed: (value c4) from 41 to 50
   goals met: 3 of 6
29. (increase_rate c4)
   changed: (rate_value c4) from 9 to 10
   goals met: 3 of 6
30. (increment c5)
   changed: (value c5) from 42 to 47
   goals met: 3 of 6
31. (increment c5)
   changed: (value c5) from 47 to 52
   goals met: 4 of 6
32. (increment c4)
   changed: (value c4) from 50 to 60
   goals met: 3 of 6
33. (increment c3)
   changed: (value c3) from 79 to 84
   goals met: 3 of 6
34. (increment c3)
   changed: (value c3) from 84 to 89
   goals met: 3 of 6
35. (increment c5)
   changed: (value c5) from 52 to 57
   goals met: 3 of 6
36. (increment c5)
   changed: (value c5) from 57 to 62
   goals met: 4 of 6
37. (increment c4)
   changed: (value c4) from 60 to 70
   goals met: 3 of 6
38. (increment c5)
   changed: (value c5) from 62 to 67
   goals met: 3 of 6
39. (increment c4)
   changed: (value c4) from 70 to 80
   goals met: 3 of 6
40. (increment c3)
   changed: (value c3) from 89 to 94
   goals met: 3 of 6
41. (decrement c2)
   changed: (value c2) from 96 to 93
   goals met: 4 of 6
42. (increment c5)
   changed: (value c5) from 67 to 72
   goals met: 4 of 6
43. (increment c5)
   changed: (value c5) from 72 to 77
   goals met: 4 of 6
44. (increment c5)
   changed: (value c5) from 77 to 82
   goals met: 5 of 6
45. (increment c4)
   changed: (value c4) from 80 to 90
   goals met: 4 of 6
46. (increment c5)
   changed: (value c5) from 82 to 87
   goals met: 4 of 6
47. (increment c5)
   changed: (value c5) from 87 to 92
   goals met: 5 of 6
48. (decrement c3)
   changed: (value c3) from 94 to 89
   goals met: 5 of 6
49. (decrement c2)
   changed: (value c2) from 93 to 90
   goals met: 5 of 6
50. (decrement c2)
   changed: (value c2) from 90 to 87
   goals met: 6 of 6
